//------------------------------------------------------Task 1--------------------------------------------------------------
// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x =+prompt();
//
// if (x !== 0 ) {
//     document.write('Вірно')
// } else if (x === 0) {
//     document.write('Невірно')
// }


//--------------------------------------------------------Task 2---------------------------------------------------------------
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).


// let time = +prompt( 'you need write one number from 0 to 59') || 'default'
// if (time >=0 && time < 15) {
//     document.write('перша четверть години')
// }
// else if (time >=15 && time <30) {
//     document.write('друга четверть години')
// }
// else if (time >=30 && time <45) {
//     document.write('третя четверть години')
// }
// else if (time >=45 && time <=59) {
//     document.write('четверта четверть години')
// }
// else {
//     document.write('???????')}


//-------------------------------------------------------Task 3------------------------------------------------------------------------------
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).


// let day = +prompt('enter 1 to 31')
// if (day >= 1 && day < 10){
//     console.log('first');
// }
// else if (day >=10 && day < 20){
//     console.log('second');
// }
// else if (day >=20 && day <= 31){
//     console.log('third');}
// else {
//     console.log('not the day of the month')
// }


//-------------------------------------------------------Task 4------------------------------------------------------------------------------
//- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що
// заплановано на цей день (можна замість плану на день, назву дня англійською).

// switch ('?????') {
//     case "1":
//         console.log('monday');
//         break;
//     case "2":
//         console.log('tuesday');
//         break;
//     case "3":
//         console.log('wednesday');
//         break;
//     case "4":
//         console.log('thursday');
//         break;
//     case "5":
//         console.log('friday');
//         break;
//     case "6":
//         console.log('saturday');
//         break;
//     case "7":
//         console.log('sunday');
//         break;
// }


//-------------------------------------------------------Task 5------------------------------------------------------------------------------
// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.


// let a = +prompt( 'enter number')
// let b = +prompt( 'enter number')
// if (a > b) {
//     document.write(a)
// }
// else if (a < b) {
//     document.write(b)
// }
// else if (a === b) {
//     document.write('equally')
// }


//-------------------------------------------------------Task 6------------------------------------------------------------------------------
// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//     за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

// let x = prompt() || 'default'
// console.log(x)